package com.javaex.practice;

public class Ex06 {

	public static void main(String[] args) {
//		아래의 설명 중 틀린 것을 찾아서 수정해 보세요.
//		(1) 변수한개에는 동시에 여러 개의 값을 담을 수 있다.
//		(2) 변수는 선언시에 사용한 타입의 값만 저장할 수 있다.
//		(3) 변수는 초기값이 저장되지 않아도 읽을 수 있다.
//		(4) 모든 자료형의 변수는 동일한 방식으로 저장된다.
//		(5) double형은 float보다 큰 수를 담을 수 있다.
//		(6) int, float, char, String은 모두 기본자료형에 속한다
//		(7) final로 선언된 변수는 수정이 가능하다
//		(8) long형에는 항상 ‘L’을 붙여서 대입해야 한다.
//		(9) float형에는 항상 ‘F’을 붙여서 대입해야 한다.

//		답 : 
//		(1) 변수 한 개에는 한 개의 값만 담을 수 있다.
//		(2) 변수는 선언시에 사용한 타입의 값만 저장할 수 있다.
//		(3) 변수는 초기값이 저장되지 않으면 읽을 수 없다.
//		(4) 모든 자료형의 변수는 각자의 자료형이 요구되는 방식으로 저장된다.
//		(5) double형은 float보다 큰 수를 담을 수 없다.
//		(6) float, char, String은 모두 기본자료형에 해당하지 않는다. 
//		(7) final로 선언된 변수는 수정이 불가능하다
	}

}
